/**
 * 
 */
package com.mysheng.office.base;

/**
 * <pre>
 * <p>Title: </p>
 * <p>Description: 错误编码说明：错误编码共六位， 前两位表示错误级别，中间两位为模块，后两位为错误错误编码，
 * 				        错误级别：10:系统级别，20：服务级别
 * 				        模块：01：数据查询模块，02：运维模块，03：预处理模块，04：数据分析模块
 * 				   eg:100101
 * 				   10为系统级别错误，01为模块，01为错误编码</p>
 * <p>Copyright: Copyright (c) 2010 - 2016 </p>
 * <p>Company: Beijing Risenb Technology Co.,Ltd. </p>
 * <p>Build: 2016年11月7日 下午6:26:05 </p>
 * </pre>
 *
 * @author Chang Yuxin
 * @version 1.0
 */
public enum Errors {
	//----------------------------------------系统
	_100101("100101", " 系统错误！"),
	//----------------------------------------数据查询模块
	_200101("200101", " 查询数据失败！"),
	_200102("200102", " 查询数据无结果！"),
	_200103("200103", " 统计数据失败！"),
	_200104("200104", " 统计数据无结果！"),
	_200105("200105", " 没有权限！"),
	_200106("200106", " 不一致"),
	
	_200129("200129", "还未到预约时间，请稍后！"),
	_200130("200130", "已超过预约时间，请重新申请！"),
	
	//----------------------------------------数据运维模块
	_200201("200201", " 参数为空！"),
	_200202("200202", " 参数长度超长，最大:"),
	_200203("200203", " 查询无结果！"),
	_200204("200204", " 更新失败！"),
	_200205("200205", " 删除失败！"),
	_200206("200206", " 请输入数字！"),
	_200207("200207", " 不能小于1 ！"),
	_200208("200208", " 不能大于100 ！"),
	_200209("200209", " 格式不正确！"),
	_200211("200211", " 添加失败！"),
	_200212("200212", " 参数错误！"),
	_200213("200213", " 预约信息创建者不一致！"),
	
	_300101("300101", "用户未登陆！"),
	_300104("300104", "手机号已注册！"),
	_300105("300105", "不存在！"),
	_300106("300106", "账号密码错误！"),
	_300113("300113", "当前第三方已经关联其它账号 ！"),
	_300117("300117", "手机号还未注册！"),
	_300120("300120", "错误！"),
	_300121("300121", "失败！"),
	_300122("300122", "已关注医师！"),
	_300123("300123", "已点赞这条动态！"),
	_300124("300124", "不是发布者，所以不能删除动态！"),
	_300125("300125", "用户类型不对！"),
	_300126("300126", "请选择其他直播时间段！"),
	_300127("300127", "已经预约该直播！"),
	_300128("300128", "不是本人开的直播！"),
	_300129("300129", "直播审核失败！"),
	_300130("300130", "直播已删除！"),
	_300131("300131", "直播已结束！"),
	_300132("300132", "直播未付款！"),
	_300133("300133", "直播不可以踢人！"),
	_300134("300134", "直播不可以踢自己！"),
	_300135("300135", "没有该用户！"),
	_300137("300137", "不是发布者，所以不能删除评论!"),
	_300138("300138", "不是创建者，所以不能删除动态!"),
	_300139("300139", "不是创建者，所以不能取消订单!"),
	_300140("300140", "用户未绑定银行卡,请先绑定!"),
	_300141("300141", "已有认证医师信息，不能再次认证!"),
	_300142("300142", "医师认证时间小于一个月，不能重新认证!"),
	_300143("300143", "医师开启失败!"),
	_300144("300144", "学术文章创建者信息不一致!"),
	_300145("300145", "结束时间超过当月!"),
	_300146("300146", "时间段内有重复的预约信息!"),
	_300147("300147", "该用户已存在！")
	;

	/** 错误编码 */
	private String errorCode;

	/** 错误信息 */
	private String errorMsg;

	private Errors(String errorCode, String errorMsg) {
		this.errorCode = errorCode;
		this.errorMsg = errorMsg;
	}

	/**
	 * @return the errorCode
	 */
	public String getErrorCode() {
		return errorCode;
	}
	
	/**
	 * @param name
	 * @return String
	 */
	public static String code(String name){
		return Errors.valueOf(name).errorCode;
	}
	
	/**
	 * @param errorCode the errorCode to set
	 */
	public void setErrorCode(String errorCode) {
		this.errorCode = errorCode;
	}

	/**
	 * @return the errorMsg
	 */
	public String getErrorMsg() {
		return errorMsg;
	}
	
	/**
	 * @param name
	 * @return String
	 */
	public static String msg(String name){
		return Errors.valueOf(name).errorMsg;
	}
	
	/**
	 * @param errorMsg the errorMsg to set
	 */
	public void setErrorMsg(String errorMsg) {
		this.errorMsg = errorMsg;
	}
}
